"""
МОДУЛЬ 6 - Владимир Трясцын

А.С Пушкина = 26 мая 1799 г
М.Ю. Лермонтова = 15 октября 1814
Николай Васильевич Гоголья = 31 марта 1809
Лев Николаевич Толстого = 9 сентября 1828
Фёдор Миха́йлович Достоевский = 11 ноября 1821
Михаил Михайлович Жванецкий = 6 марта 1934
Борис Натанович Стругацкий = 15 апреля 1933
Аркадий Натанович Стругацкий = 28 августа 1925
Андре́й Арсе́ньевич Тарко́вский = 4 апреля 1932
"""

fio_birth = [("Александра Сергеевича Пушкина", 1799), ("Михаила Юрьевича Лермонтова", 1814),
             ("Николайя Васильевича Гоголья", 1809), ("Льва Николаевича Толстого", 1828),
             ("Фёдора Миха́йловича Достоевского", 1821), ("Михаила Михайловича Жванецкого", 1934),
             ("Бориса Натановича Стругацкого", 1933), ("Аркадия Натановича Стругацкого", 1925),
             ("Андрея Арсеньевича Тарковского", 1932)]
good_answer = 0
bad_answer = 0
index = 0
ix_name = 0     # Индекс значения наименования ФИО
ix_year = 1     # Индекс значения года рождения

while True:
    # Удобней использовать цикл for в данном примере, но так как пока используем while, то....
    while index < len(fio_birth):
        index += 1
        year_birth = input('Введите год рождения {}: '.format(fio_birth[index - 1][ix_name]))
        if not year_birth.isdigit():
            bad_answer += 1
            continue
        year_birth = int(year_birth)
        if year_birth == fio_birth[index - 1][ix_year]:
            good_answer += 1
        else:
            bad_answer += 1

    # Вывод результатов викторины
    print("Количество правильных ответов = {}".format(good_answer))
    print("Количество ошибок = {}".format(bad_answer))
    print("Процент правильных ответов = {:0.2f} %".format(good_answer * 100 / len(fio_birth)))
    print("Процент ошибочных ответов = {:0.2f} %".format(bad_answer * 100 / len(fio_birth)))

    # Вы хотите повторить викторину?
    next_answer = input('Вы хотите повторить викторину? (Да/Нет): ')
    while not next_answer.upper() in ["ДА", "НЕТ"]:
        next_answer = input('Повторите Ваш ответ. Вы хотите повторить викторину? (Да/Нет): ')
    if next_answer.upper() == "ДА":
        good_answer = 0
        bad_answer = 0
        index = 0
    else:
        break


